---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabDbChangeConn
source: html/587e7425-4d77-bd37-96c9-a43e977ed6f0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabDbChangeConn Property

Fabrication Database changes altered connectivity

## Syntax (C#)
```csharp
public static FailureDefinitionId FabDbChangeConn { get; }
```